Revit 2026 API
SlabShapeEditor.ResetSlabShape Method
Removes the modifications made during editing and resets the element geometry back to the unmodified state.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public void ResetSlabShape()
Public Sub ResetSlabShape
public:
void ResetSlabShape()
member ResetSlabShape : unit -> unit
Remarks
Calling this method will reset the slab back to its original state and disable Slab Shape Editing. If further editing is needed, call Enable again.
See Also
Reference
SlabShapeEditor Class
Autodesk.Revit.DB Namespace